feaser/openblt/Target/Source/ARMCM4_STM32L4/flash.c
/************************************************************************************//**
* \file         Source/ARMCM4_STM32L4/flash.c
* \brief        Bootloader flash driver source file.
* \ingroup      Target_ARMCM4_STM32L4
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*   Copyright (c) 2018  by Feaser    http://www.feaser.com    All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* This file is part of OpenBLT. OpenBLT is free software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published by the Free
* Software Foundation, either version 3 of the License, or (at your option) any later
* version.
*
* OpenBLT is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
* without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
* PURPOSE. See the GNU General Public License for more details.
*
* You have received a copy of the GNU General Public License along with OpenBLT. It
* should be located in ".\Doc\license.html". If not, contact Feaser to obtain a copy.
*
* \endinternal
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "boot.h"                                /* bootloader generic header          */
#include "stm32l4xx.h"                           /* STM32 CPU and HAL header           */



/****************************************************************************************
* Macro definitions
****************************************************************************************/
/** \brief Value for an invalid flash address. */
#define FLASH_INVALID_ADDRESS           (0xffffffff)
/** \brief Standard size of a flash block for writing. */
#define FLASH_WRITE_BLOCK_SIZE          (512)
/** \brief Standard size of a flash sector for erasing. */
#define FLASH_ERASE_SECTOR_SIZE         (2048)
/** \brief Total numbers of segments in array flashLayout[]. */
#define FLASH_TOTAL_SEGMENTS            (sizeof(flashLayout)/sizeof(flashLayout[0]))
/** \brief Index of the last segment in array flashLayout[]. */
#define FLASH_LAST_SEGMENT_IDX          (FLASH_TOTAL_SEGMENTS-1)
/** \brief Start address of the bootloader programmable flash. */
#define FLASH_START_ADDRESS             (flashLayout[0].sector_start)
/** \brief End address of the bootloader programmable flash. */
#define FLASH_END_ADDRESS               (flashLayout[FLASH_LAST_SEGMENT_IDX].sector_start + \
                                         flashLayout[FLASH_LAST_SEGMENT_IDX].sector_size - 1)
/** \brief Offset into the user program's vector table where the checksum is located.
 *         For this target it is set to the end of the vector table. Note that the
 *         value can be overriden in blt_conf.h, because the size of the vector table
 *         could vary. When changing this value, don't forget to update the location
 *         of the checksum in the user program accordingly. Otherwise the checksum
 *         verification will always fail.
 */
#ifndef BOOT_FLASH_VECTOR_TABLE_CS_OFFSET
#define BOOT_FLASH_VECTOR_TABLE_CS_OFFSET    (0x188)
#endif


/****************************************************************************************
* Plausibility checks
****************************************************************************************/
#if (BOOT_FLASH_VECTOR_TABLE_CS_OFFSET >= FLASH_WRITE_BLOCK_SIZE)
#error "BOOT_FLASH_VECTOR_TABLE_CS_OFFSET is set too high. It must be located in the first writable block."
#endif

#ifndef BOOT_FLASH_CUSTOM_LAYOUT_ENABLE
#define BOOT_FLASH_CUSTOM_LAYOUT_ENABLE (0u)
#endif


/****************************************************************************************
* Type definitions
****************************************************************************************/
/** \brief Flash sector descriptor type. */
typedef struct
{
  blt_addr   sector_start;                       /**< sector start address             */
  blt_int32u sector_size;                        /**< sector size in bytes             */
} tFlashSector;

/** \brief    Structure type for grouping flash block information.
 *  \details  Programming is done per block of max FLASH_WRITE_BLOCK_SIZE. for this a
 *            flash block manager is implemented in this driver. this flash block manager
 *            depends on this flash block info structure. It holds the base address of
 *            the flash block and the data that should be programmed into the flash
 *            block. The .base_addr must be a multiple of FLASH_WRITE_BLOCK_SIZE.
 */
typedef struct
{
  blt_addr  base_addr;
  blt_int8u data[FLASH_WRITE_BLOCK_SIZE];
} tFlashBlockInfo;


/****************************************************************************************
* Hook functions
****************************************************************************************/
#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
extern blt_bool FlashCryptoDecryptDataHook(blt_int8u * data, blt_int32u size);
#endif


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static blt_bool   FlashInitBlock(tFlashBlockInfo *block, blt_addr address);
static tFlashBlockInfo *FlashSwitchBlock(tFlashBlockInfo *block, blt_addr base_addr);
static blt_bool   FlashAddToBlock(tFlashBlockInfo *block, blt_addr address,
                                  blt_int8u *data, blt_int32u len);
static blt_bool   FlashWriteBlock(tFlashBlockInfo *block);
static blt_int32u FlashGetPage(blt_addr address);
static blt_int32u FlashGetBank(blt_addr address);


/****************************************************************************************
* Local constant declarations
****************************************************************************************/
/** \brief   If desired, it is possible to set BOOT_FLASH_CUSTOM_LAYOUT_ENABLE to > 0
 *           in blt_conf.h and then implement your own version of the flashLayout[] table
 *           in a source-file with the name flash_layout.c. This way you customize the
 *           flash memory size reserved for the bootloader, without having to modify
 *           the flashLayout[] table in this file directly. This file will then include
 *           flash_layout.c so there is no need to compile it additionally with your
 *           project.
 */
#if (BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0)
/** \brief   Array wit the layout of the flash memory. Note that the current flash driver
 *           supports the STM32L4x1, STM32L4x5 and STM32L4x6 derivatives in the STM32L4
 *           family of microcontrollers.
 *  \details Also controls what part of the flash memory is reserved for the bootloader.
 *           If the bootloader size changes, the reserved sectors for the bootloader
 *           might need adjustment to make sure the bootloader doesn't get overwritten.
 */
static const tFlashSector flashLayout[] =
{
  /* space is reserved for a bootloader configuration with all supported communication
   * interfaces enabled. when for example only UART is needed, then the space required
   * for the bootloader can be made a lot smaller here.
   */
  /* { 0x08000000, 0x00800 },           flash sector  0 - 2kb (reserved for bootloader)*/
  /* { 0x08000800, 0x00800 },           flash sector  1 - 2kb (reserved for bootloader)*/
  /* { 0x08001000, 0x00800 },           flash sector  2 - 2kb (reserved for bootloader)*/
  /* { 0x08001800, 0x00800 },           flash sector  3 - 2kb (reserved for bootloader)*/
  /* { 0x08002000, 0x00800 },           flash sector  4 - 2kb (reserved for bootloader)*/
  { 0x08002800, 0x00800 },              /* flash sector  5 - 2kb                       */
  { 0x08003000, 0x00800 },              /* flash sector  6 - 2kb                       */
  { 0x08003800, 0x00800 },              /* flash sector  7 - 2kb                       */
  { 0x08004000, 0x00800 },              /* flash sector  8 - 2kb                       */
  { 0x08004800, 0x00800 },              /* flash sector  9 - 2kb                       */
  { 0x08005000, 0x00800 },              /* flash sector 10 - 2kb                       */
  { 0x08005800, 0x00800 },              /* flash sector 11 - 2kb                       */
  { 0x08006000, 0x00800 },              /* flash sector 12 - 2kb                       */
  { 0x08006800, 0x00800 },              /* flash sector 13 - 2kb                       */
  { 0x08007000, 0x00800 },              /* flash sector 14 - 2kb                       */
  { 0x08007800, 0x00800 },              /* flash sector 15 - 2kb                       */
  { 0x08008000, 0x00800 },              /* flash sector 16 - 2kb                       */
  { 0x08008800, 0x00800 },              /* flash sector 17 - 2kb                       */
  { 0x08009000, 0x00800 },              /* flash sector 18 - 2kb                       */
  { 0x08009800, 0x00800 },              /* flash sector 19 - 2kb                       */
  { 0x0800A000, 0x00800 },              /* flash sector 20 - 2kb                       */
  { 0x0800A800, 0x00800 },              /* flash sector 21 - 2kb                       */
  { 0x0800B000, 0x00800 },              /* flash sector 22 - 2kb                       */
  { 0x0800B800, 0x00800 },              /* flash sector 23 - 2kb                       */
  { 0x0800C000, 0x00800 },              /* flash sector 24 - 2kb                       */
  { 0x0800C800, 0x00800 },              /* flash sector 25 - 2kb                       */
  { 0x0800D000, 0x00800 },              /* flash sector 26 - 2kb                       */
  { 0x0800D800, 0x00800 },              /* flash sector 27 - 2kb                       */
  { 0x0800E000, 0x00800 },              /* flash sector 28 - 2kb                       */
  { 0x0800E800, 0x00800 },              /* flash sector 29 - 2kb                       */
  { 0x0800F000, 0x00800 },              /* flash sector 30 - 2kb                       */
  { 0x0800F800, 0x00800 },              /* flash sector 31 - 2kb                       */
  { 0x08010000, 0x10000 },              /* flash sectors 32 to 63 - 64kb               */
  { 0x08020000, 0x20000 },              /* flash sectors 64 to 127 - 128kb             */
#if (BOOT_NVM_SIZE_KB > 256)
  { 0x08040000, 0x40000 },              /* flash sectors 128 to 255 - 256kb            */
#endif
#if (BOOT_NVM_SIZE_KB > 512)
  { 0x08080000, 0x80000 }               /* flash sectors 256 to 511 - 512kb            */
#endif
#if (BOOT_NVM_SIZE_KB > 1024)
#error "BOOT_NVM_SIZE_KB > 1024 is currently not supported."
#endif
};
#else
#include "flash_layout.c"
#endif /* BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0 */


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief   Local variable with information about the flash block that is currently
 *           being operated on.
 *  \details The smallest amount of flash that can be programmed is
 *           FLASH_WRITE_BLOCK_SIZE. A flash block manager is implemented in this driver
 *           and stores info in this variable. Whenever new data should be flashed, it
 *           is first added to a RAM buffer, which is part of this variable. Whenever
 *           the RAM buffer, which has the size of a flash block, is full or  data needs
 *           to be written to a different block, the contents of the RAM buffer are
 *           programmed to flash. The flash block manager requires some software
 *           overhead, yet results is faster flash programming because data is first
 *           harvested, ideally until there is enough to program an entire flash block,
 *           before the flash device is actually operated on.
 */
static tFlashBlockInfo blockInfo;

