feaser/openblt/Target/Source/ARMCM4_STM32L4/flash.c
  /* initialize tne new block when necessary */
  if (FlashInitBlock(block, base_addr) == BLT_FALSE)
  {
    return BLT_NULL;
  }

  /* still here to all is okay  */
  return block;
} /*** end of FlashSwitchBlock ***/


/************************************************************************************//**
** \brief     Programming is done per block. This function adds data to the block
**            that is currently collecting data to be written to flash. If the
**            address is outside of the current block, the current block is written
**            to flash an a new block is initialized.
** \param     block   Pointer to flash block info structure to operate on.
** \param     address Flash destination address.
** \param     data    Pointer to the byte array with data.
** \param     len     Number of bytes to add to the block.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashAddToBlock(tFlashBlockInfo *block, blt_addr address,
                                blt_int8u *data, blt_int32u len)
{
  blt_addr   current_base_addr;
  blt_int8u  *dst;
  blt_int8u  *src;

  /* determine the current base address */
  current_base_addr = (address/FLASH_WRITE_BLOCK_SIZE)*FLASH_WRITE_BLOCK_SIZE;

  /* make sure the blockInfo is not uninitialized */
  if (block->base_addr == FLASH_INVALID_ADDRESS)
  {
    /* initialize the blockInfo struct for the current block */
    if (FlashInitBlock(block, current_base_addr) == BLT_FALSE)
    {
      return BLT_FALSE;
    }
  }

  /* check if the new data fits in the current block */
  if (block->base_addr != current_base_addr)
  {
    /* need to switch to a new block, so program the current one and init the next */
    block = FlashSwitchBlock(block, current_base_addr);
    if (block == BLT_NULL)
    {
      return BLT_FALSE;
    }
  }

  /* add the data to the current block, but check for block overflow */
  dst = &(block->data[address - block->base_addr]);
  src = data;
  do
  {
    /* keep the watchdog happy */
    CopService();
    /* buffer overflow? */
    if ((blt_addr)(dst-&(block->data[0])) >= FLASH_WRITE_BLOCK_SIZE)
    {
      /* need to switch to a new block, so program the current one and init the next */
      block = FlashSwitchBlock(block, current_base_addr+FLASH_WRITE_BLOCK_SIZE);
      if (block == BLT_NULL)
      {
        return BLT_FALSE;
      }
      /* reset destination pointer */
      dst = &(block->data[0]);
    }
    /* write the data to the buffer */
    *dst = *src;
    /* update pointers */
    dst++;
    src++;
    /* decrement byte counter */
    len--;
  }
  while (len > 0);
  /* still here so all is good */
  return BLT_TRUE;
} /*** end of FlashAddToBlock ***/


/************************************************************************************//**
** \brief     Programs FLASH_WRITE_BLOCK_SIZE bytes to flash from the block->data
**            array.
** \param     block   Pointer to flash block info structure to operate on.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashWriteBlock(tFlashBlockInfo *block)
{
  blt_addr   prog_addr;
  uint64_t   prog_data;
  blt_int32u doubleword_cnt;
  blt_bool   result = BLT_TRUE;
  
#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
  #if (BOOT_NVM_CHECKSUM_HOOKS_ENABLE == 0)
  /* note that the bootblock is already decrypted in FlashWriteChecksum(), if the
   * internal checksum mechanism is used. Therefore don't decrypt it again.
   */
  if (block != &bootBlockInfo)
  #endif
  {
    /* perform decryption of the program data before writing it to flash memory. */
    if (FlashCryptoDecryptDataHook(block->data, FLASH_WRITE_BLOCK_SIZE) == BLT_FALSE)
    {
      return BLT_FALSE;
    }
  }
#endif


  /* unlock access to the flash device */
  HAL_FLASH_Unlock();

  /* clear OPTVERR bit set on virgin samples */
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR); 
  
  /* program all double words in the block one by one */
  for (doubleword_cnt=0; doubleword_cnt<(FLASH_WRITE_BLOCK_SIZE/sizeof(uint64_t)); doubleword_cnt++)
  {
    prog_addr = block->base_addr + (doubleword_cnt * sizeof(uint64_t));
    prog_data = *(volatile uint64_t *)(&block->data[doubleword_cnt * sizeof(uint64_t)]);
    /* keep the watchdog happy */
    CopService();
    /* program the double word */
    if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, prog_addr, prog_data) != HAL_OK)
    {
      /* error detected. flag it and stop */
      result = BLT_FALSE;
      break;
    }
    /* verify that the written data is actually there */
    if (*(volatile uint64_t *)prog_addr != prog_data)
    {
      result = BLT_FALSE;
      break;
    }
  }

  /* lock access to the flash device */
  HAL_FLASH_Lock();
  
  /* return the result */
  return result;
} /*** end of FlashWriteBlock ***/


/************************************************************************************//**
** \brief     Gets the page number of the address relative to the bank.
** \param     address Address in the flash bank.
** \return    The page of the given address: 0..255.
**
****************************************************************************************/
static blt_int32u FlashGetPage(blt_addr address)
{
  blt_int32u page = 0;
  
  /* is the address in the first bank? note that this can be either FLASH_BANK_1 or 
   * FLASH_BANK_2, due to the flash swap feature.
   */
  if (address < (FLASH_BASE + FLASH_BANK_SIZE))
  {
    page = (address - FLASH_BASE) / FLASH_PAGE_SIZE;
  }
  /* address is in the second bank */
  else
  {
    page = (address - (FLASH_BASE + FLASH_BANK_SIZE)) / FLASH_PAGE_SIZE;
  }
  
  return page;
} /*** end of FlashGetPage ***/


/************************************************************************************//**
** \brief     Obtains the bank of the given address. The 1024kb version of the flash
**            device contains 2 banks that can be swapped. This feature breaks the link
**            between a bank number and flash addresses. This function obtains the
**            bank number that is currently at the given address.
** \param     address Address in the flash bank.
** \return    The flash bank of the given address: FLASH_BANK_1 or FLASH_BANK_2. 
**
****************************************************************************************/
static blt_int32u FlashGetBank(blt_addr address)
{
  blt_int32u bank = FLASH_BANK_1;
	
	/* multiple banks is only supported on certain STM32L4xx derivatives. */
#if defined (STM32L471xx) || defined (STM32L475xx) || defined (STM32L476xx) || \
	  defined (STM32L485xx) || defined (STM32L486xx) || defined (STM32L496xx) || \
	  defined (STM32L4A6xx) || defined (STM32L4R5xx) || defined (STM32L4R7xx) || \
	  defined (STM32L4R9xx) || defined (STM32L4S5xx) || defined (STM32L4S7xx) || \
	  defined (STM32L4S9xx)
  /* check flash bank mode selection bit to determine if banks 1 and 2 are swapped */
  if (READ_BIT(SYSCFG->MEMRMP, SYSCFG_MEMRMP_FB_MODE) == 0)
  {
  	/* no bank swap active */
    if (address < (FLASH_BASE + FLASH_BANK_SIZE))
    {
      bank = FLASH_BANK_1;
    }
    else
    {
      bank = FLASH_BANK_2;
    }
  }
  else
  {
  	/* bank swap active */
    if (address < (FLASH_BASE + FLASH_BANK_SIZE))
    {
      bank = FLASH_BANK_2;
    }
    else
    {
      bank = FLASH_BANK_1;
    }
  }
#endif	
  
  return bank;
} /*** end of FlashGetBank ***/


/*********************************** end of flash.c ************************************/
